<?php

return [

    'boolean' => 'الرجآء إدخال قيمة نعم أو لا ',
    'confirmed' => 'The :attribute confirmation does not match.',
    'date' => 'يجب إدخال قيمة تاريخ صحيحة',
    'date_format' => 'صيغة التاريخ غير صحيحة',
    'digits' => 'يجب إدخال قيمة رقمية',
    'email' => 'يجب إدخال صيغة بريد إلكتروني صحيحة',
    'exists' => 'يجب إدخال قيمة موجودة',
    'image' => 'The :attribute must be an image.',
    'in' => 'القيمة المدخلة غير صحيحة',
    'integer' => 'يجب إدخال قيمة عددية صحيحة.',
    'required' => 'هذا الحقل مطلوب',
    'string' => 'يجب إدخال قيمة نصّية.',
    'unique' => 'يجب إدخال قيمة غير مستخدمة مسبقاً',
    'old_password_mismatch' => 'كلمة المرور القديمة غير صحيحة',
    'custom' => [
      'sp_study_year.required_without' => 'يجب إدخال السنة الدراسية إن كان الحالة غير متخرّج',
      'sp_id_number.size' => 'يجب إدخال رقم هوية مكوّن من 9 خانات',
      'sp_email.unique' => 'يجب استخدام بريد إلكتروني غير مستخدم مسبقاً',
      'sr_email.unique' => 'يجب استخدام بريد إلكتروني غير مستخدم مسبقاً',
      'user_email.unique' => 'يجب استخدام بريد إلكتروني غير مستخدم مسبقاً',
    ]
];
